ys1797/esp32_hd/main/hd_main.c
	/* Запуск http сервера */
	hd_httpd_init();	

	/* Настройка таймера */
	tg0_timer0_init();

	/* Запуск отображения на дисплее */
	hd_display_init();

	/* Настройка PZEM */
	xTaskCreate(&pzem_task, "pzem_task", 2048, NULL, 1, NULL);

	ledc_timer_config_t ledc_timer = {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
		.duty_resolution = LEDC_TIMER_10_BIT,
#else
		.bit_num = LEDC_TIMER_10_BIT,
#endif
		.freq_hz = LED_HZ*2,
		.speed_mode = LEDC_HIGH_SPEED_MODE,
		.timer_num = LEDC_TIMER_0
	};
	ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer));

        ledc_channel_config_t ledc_channel = {
            .gpio_num = GPIO_TRIAC,
            .speed_mode = LEDC_HIGH_SPEED_MODE,
            .channel = 0,
            .timer_sel = LEDC_TIMER_0,
            .duty = (1 << LEDC_TIMER_10_BIT) - 1,
            .intr_type = LEDC_INTR_DISABLE,
	};
	ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));

	LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
        // Initial brightness of 0, meaning turn TRIAC on at very end:
        LEDC.channel_group[0].channel[0].conf0.sig_out_en = 1;
	LEDC.channel_group[0].channel[0].conf1.duty_start = 1;

	// Настройка клапанов управления
	for (int i=0; i<MAX_KLP; i++) {
		ledc_channel_config_t ledc_channel = {
			.gpio_num = klp_gpio[i],
			.speed_mode = LEDC_HIGH_SPEED_MODE,
			.channel = i+1,
			.timer_sel = LEDC_TIMER_0,
			.duty = 0,
			.intr_type = LEDC_INTR_DISABLE,
		};
		Klp[i].is_open = false;
		Klp[i].channel = i+1;
		Klp[i].pwm_task_Handle=NULL;
		ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));
		LEDC.channel_group[0].channel[i+1].conf0.sig_out_en = 0;
	}
	ledc_fade_func_install(0);

	valve_cmd_queue = xQueueCreate(10, sizeof(valveCMDmessage_t));			//---очередь команд открытия/закрытия клапанов
	if (! valve_cmd_queue){
		ESP_LOGE(__func__,"error of QUEUE creating!");
	}
	else {
		xTaskCreate(valveCMDtask, "valveCMDtask", 8192, NULL, 5, NULL);	//---задача включения/выключения клапанов по командам
	}

	/* задача контроля флагов тревоги и выключения дифф-автомата*/
	xTaskCreate(&alarmControlTask, "alarmControl", 4096, NULL, 1, NULL);
	if (getIntParam(DEFL_PARAMS, "DIFFoffOnStart")) {// при настройке "выключать дифф при старте"
		xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
	}

	ESP_ERROR_CHECK(gpio_intr_enable(GPIO_DETECT_ZERO));
	ESP_LOGI(TAG, "Enabled zero crossing interrupt.\n");

	if (getIntParam(DEFL_PARAMS, "useExernalAlarm")) {
		ESP_ERROR_CHECK(gpio_intr_enable(GPIO_ALARM));
	}

	if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(false);

	while (true) {
		cJSON *ja = getInformation();
     		char *r=cJSON_Print(ja);
		cgiWebsockBroadcast("/ws", r, strlen(r), WEBSOCK_FLAG_NONE);
		cJSON_Delete(ja);
		if (r) free(r);
		if (MODE_RECTIFICATION == MainMode) Rectification();
		else if (MODE_DISTIL == MainMode) Distillation();
		vTaskDelay(wsPeriod*1000/portTICK_PERIOD_MS);
	}
}

void valveCMDtask(void *arg){
	valveCMDmessage_t qcmd;
	ledc_channel_t ch;
	TickType_t xLastWakeTime=0, prevValveSwitch=0;

	while (1){
		if (xQueueReceive(valve_cmd_queue, &qcmd, portMAX_DELAY)!=pdTRUE) // ждем события на открытие/закрытие клапана
			continue;																									// если таймаут - повторим
		ch = Klp[qcmd.valve_num].channel;															// ledc-канал  клапана
		LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
		DBG("v:%d(ch:%d) cmd:%d",qcmd.valve_num,ch,qcmd.cmd);
		switch (qcmd.cmd) {
			case cmd_open:
				if (! Klp[qcmd.valve_num].is_open) { // если клапан закрыт то открываем
					// -------логика "тихого" включения
					if (getIntParam(DEFL_PARAMS,"klpSilentNode")) {
						ledc_set_fade_with_time(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY, VALVE_ON_FADE_TIME_MS);
						ledc_fade_start(LEDC_HIGH_SPEED_MODE, ch, LEDC_FADE_NO_WAIT);
						vTaskDelay(VALVE_ON_FADE_TIME_MS/portTICK_PERIOD_MS);
					} else {
						ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
						ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					}
					xLastWakeTime = xTaskGetTickCount ();// системное время включения, в тиках
	#ifdef DEBUG
					DBG(" ON:%d(%d ms)",qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS );
					prevValveSwitch=xLastWakeTime;
	#endif
					Klp[qcmd.valve_num].is_open = true;
					// ---------логика снижения ШИМ клапана после его включения---------
					if ((qcmd.valve_num == klp_water)||((qcmd.valve_num == klp_diff))) break; 	//если вода или дифф - не снижаем

					if ((KEEP_KLP_PWM==0)||(KEEP_KLP_PWM==100)) break;								// если настройка ШИМ удержания 0 или 100 - не снижаем
					if (	(Klp[qcmd.valve_num].is_pwm)																//если клапан в ШИМ
							&&																										//и время открытого его состояния
							(KEEP_KLP_DELAY_MS >= (Klp[qcmd.valve_num].open_time*1000))			//меньше времени задержки до перехода на удержание
						)	{																											// то не снижаем
						break;
					}

					vTaskDelayUntil( &xLastWakeTime, KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS );//ждем включения механики клапана
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, ((VALVE_DUTY*KEEP_KLP_PWM)/100ul));
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
				}
				else {
					DBG("ON ignored");
				}
				break;

			case cmd_close:
				if (Klp[qcmd.valve_num].is_open){ // закрываем если открыт
#ifdef DEBUG
					xLastWakeTime = xTaskGetTickCount ();
					DBG("OFF:%d(%d ms)", qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS);
					prevValveSwitch =xLastWakeTime;
#endif
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
					Klp[qcmd.valve_num].is_open = false;
				}
				else {
					DBG("cmd close ignored");
				}
				break;
			default:
				break;
		}
	}
}
